/* Задание 1.
 *
 * Пользователь вводит в модальное окно любое число.
 *
 * В консоль вывести сообщение:
 * - Если число чётное, вывести в консоль сообщение «Ваше число чётное.»;
 * - Если число не чётное, вывести в консоль сообщение «Ваше число не чётное.»;
 * - Если пользователь ввёл не число, вывести новое модальное окно с сообщением «Необходимо ввести число!».
 * - Если пользователь во второй раз ввёл не число, вывести сообщение: «⛔️ Ошибка! Вы ввели не число.».
 */

// let number = Number(prompt("Введіть число"));

// if (Number.isNaN(number)) {
//   number = parseInt(prompt("Необходимо ввести число!"));
// }

// if (number % 2 === 0) {
//   console.log("Ваше число чётное");
// } else if (number % 2 === 1) {
//   console.log("Ваше число не чётное");
// } else {
//   console.log("⛔️ Ошибка!");
// }

// Получить от пользователя 2 числа.
// Если первое число лежит в диапазоне от 0 до 20,
// а второе - от 20 до 40 - вывести за допомогю alert повідомлення:
//  - “Вы выигрываете автомобиль!”.
//  Если хотя бы одно из чисел меньше 0,
//  вывести в модальном окне надпись “А ты хитрец”

// let number = Number(prompt("Введіть число"));
// let numberTwo = Number(prompt("Введіть друге число"));

// if (number >= 0 && number <= 20 && numberTwo >= 20 && numberTwo <= 40) {
//   alert("Вы выигрываете автомобиль!");
// } else if (number < 0 || numberTwo < 0) {
//   console.log("А ты хитрец");
// }

/* Написати програму, яка вітатиме користувача.
 * Спершу користувач вводить своє ім'я, після чого програма виводить у консоль повідомлення з урахуванням його посади.
 *
 * Список посад:
 * Mike - CEO;
 * Jane - CTO;
 * Walter - програміст:
 * Oliver - менеджер;
 * John - прибиральник.
 *
 * Якщо введено не відоме програмі ім'я — вивести в консоль повідомлення «Користувач не знайдено».
 *
 * Виконати завдання у двох варіантах:
 * - використовуючи конструкцію if/else if/else;
 * - Використовуючи конструкцію switch.
 */

let name = prompt("введіть ім'я");
// if (name === "Mike") {
//   console.log(`Вітаю, СЕО ${name}`);
// } else if (name === "Jane") {
//   console.log(`Вітаю,СТОшник ${name}`);
// } else if (name === "Oliver") {
//   console.log(`Вітаю,Менеджер ${name}`);
// } else if (name === "Walter") {
//   console.log(`Вітаю,Програміст ${name}`);
// } else if (name === "John") {
//   console.log(`Вітаю,Прибиральниця ,дякую вам світла людино ${name}`);
// } else console.log(`Користувача не знайдено`);

switch (name) {
  case "Jane":
    console.log("CTO");
    break;
  case "Walter":
    console.log("Ви програміст");
    break;
  case "Mike":
    console.log("Ви CEO");
    break;
  case "Oliver":
    console.log("Ви менеджер");
    break;
  case "John":
    console.log("Ви прибиральник");
    break;

  default:
    console.log("«Користувач не знайдено».");
}