/* 
Написати функцію filterBy(), яка прийматиме в себе 2 аргументи. 
    Перший аргумент - масив, який міститиме в собі будь-які дані,
    другий аргумент - тип даних.
Функція має повернути новий масив, який міститиме в собі всі дані,
    які були передані в аргумент, за винятком тих, тип яких був переданий другим аргументом.
Тобто, якщо передати масив ['hello', 'world', 23, '23', null], і другим аргументом передати 'string',
    то функція поверне масив [23, null].
*/

function filterBy(array, fby) {
  const newArray = array.filter((item) => typeof item !== fby);
  return newArray;
}
console.log(filterBy(["hello", "world", 23, "23", null, true], "boolean" ));
