/**
 * Завдання 1.
 *
 * За допомогою циклу вивести в консоль перші всі непарні числа,
 * які перебувають у діапазоні від 0 до 300.
 *
 * Примітка:
 * парне число - це число, яке ділиться на два.
 * Непарне число - це число, яке не ділиться на два.
 *
 * Просунута складність:
 * не виводити в консоль числа, які діляться на 5.
 */

// for (let index = 0; index <=300; index = index + 1) {
//   if (index % 2 !== 0 & index % 5 !== 0) {
//     console.log(index);
//   }
// }

/**
 * Завдання 2.
 *
 * Користувач повинен ввести два числа.
 * Якщо введене значення не є числом,
 * програма продовжує опитувати користувача до того часу,
 * Поки він не введе число.
 *
 * Коли користувач введе два числа, вивести в консоль повідомлення:
 * «Вітаємо. Введені вами числа: «ПЕРШЕ_ЧИСЛО» і «ДРУГОЕ_ЧИСЛО».».
 */

let numberOne = prompt("Введіть перше число");

while (numberOne === null || numberOne === "" || Number.isNaN(+numberOne)) {
  numberOne = +prompt("Не вірне число. Введіть коректно перше число");
}

let numberTwo = prompt("Введіть друге число");
while (numberTwo === null || numberTwo === "" || Number.isNaN(+numberTwo)) {
  numberTwo = +prompt("Не вірне число. Введіть коректно друге число");
}
console.log(`Вітаємо. Введені вами числа: ${numberOne} і ${numberTwo} `);

// /** За допомогою циклу знайдіть суму чисел від 1 до 100.*/
let sum = 0;

for (let number = 1; number <= 100; number++) {
  sum = sum + number;
  console.log(number, sum);
}
console.log(sum);
