/**
 * Написати функцію-лічильник count.
 *
 * Функція має буде володіти двома параметрами:
 * - Перший - число, з якого необхідно почати лічбу;
 * - Другий - число, яким необхідно закінчити рахунок.
 *
 * Якщо число, з якого починається рахунок, більше, ніж число,
 * яким він закінчується, вивести повідомлення:
 * «⛔️ Помилка! Рахунок неможливий.»
 *
 * Якщо обидва цих числа однакові, вивести повідомлення:
 * «⛔️ Помилка! Нічого рахувати.»
 *
 * На початку рахунку необхідно вивести повідомлення:
 * «🏁 Відлік розпочато.».
 *
 * Кожен «крок» рахунку необхідно виводити в консоль.
 * Після проходження останнього «кроку» необхідно вивести повідомлення:
 * «✅ Відлік завершено.».
 *
 */

function count(start, finish) {
  if (start > finish) {
    console.log("⛔️ Помилка! Рахунок неможливий.");
    return;
  } else if (start === finish) {
    console.log("⛔️ Помилка! Нічого рахувати.");
    return;
  }
  console.log("🏁 Відлік розпочато.");
  for (let step = start; step <= finish; step++) {
    console.log(step);
    
  }
  console.log("✅ Відлік завершено.");
}
count(10,100)